# GetField Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetField Method (Int32)
ScheduleDefinition Class See Also
---
Gets a field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleField GetField(
	int index
)
```

Visual Basic
---
```text
Public Function GetField ( _
	index As Integer _
) As ScheduleField
```

Visual C++
---
```text
public:
ScheduleField^ GetField(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the field.
# ### Return Value
The field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid field index in this ScheduleDefinition. |

# See Also
ScheduleDefinition Class
GetField Overload
Autodesk.Revit.DB Namespace